README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Numerical Experiment Data Recorder</title>
<!-- 2020-11-12 四 09:56 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Dou Meishi" />
<link rel="stylesheet" type="text/css" href="http://gongzhitaao.org/orgcss/org.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Numerical Experiment Data Recorder</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Dependency</a></li>
<li><a href="#sec-2">2. Usage</a>
<ul>
<li><a href="#sec-2-1">2.1. process level</a></li>
<li><a href="#sec-2-2">2.2. code level</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Implementation</a></li>
</ul>
</div>
</div>
<p>
Record date, script content, parameter settings, results of the numerical experiment, etc, in a MySQL database. 
</p>

<p>
Designed for linux (might be portable).
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Dependency</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><code>Python</code>, command <code>python3</code> should be available
</li>
<li><code>MySQL</code>, relational database management system
</li>
<li><code>pymysql</code>, database api
</li>
<li><code>git</code>, record your script
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Usage</h2>
<div class="outline-text-2" id="text-2">
<p>
Two ways are provided, while one need modify your code and the other needn't. But in both cases, we assume current directory is a git repository. 
</p>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> process level</h3>
<div class="outline-text-3" id="text-2-1">
<p>
run following command:
</p>

<div class="org-src-container">

<pre class="src src-bash">nedr &lt;calculator.py&gt; --config &lt;paras.json&gt; --desc &lt;description&gt; --data &lt;results.data&gt; ...
</pre>
</div>

<p>
where
</p>

<ul class="org-ul">
<li><code>&lt;calculator.py&gt;</code> the script that do the computations
</li>

<li><code>&lt;paras.json&gt;</code> json file storing parameter values of this experiment
</li>

<li><code>&lt;description&gt;</code> description for this experiment
</li>

<li><code>&lt;result.data&gt;</code> output data(s) you want to store. If not given, set it to the newer files in current directory after executing <code>&lt;calculator.py&gt;</code>. This option should be given as the last one because any string after it will be treat as a data filename.  
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> code level</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Import this module in <code>Python</code> and call method <code>nedr.register(...)</code>.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #859900; font-weight: bold;">import</span> os
<span style="color: #859900; font-weight: bold;">import</span> nedr

<span style="color: #268bd2;">calculator</span> = os.path.basename(__file__)
<span style="color: #268bd2;">paras</span> = {}

<span style="color: #268bd2;">datapath</span>, <span style="color: #268bd2;">recordID</span> = nedr.register(calculator, paras, **kw)

<span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">save your result to datapath</span>
</pre>
</div>

<p>
And after that you can also call <code>nedr.get_datapath(recordID)</code> to get the same datapath. Method <code>nedr.delete_record(recordID)</code> remove a record from database and delete all files in the corresponding datapath. Though these methods should be rarely used. Users can directly query the database whenver they need and do whatever they want.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Implementation</h2>
<div class="outline-text-2" id="text-3">
<p>
We implement function <code>register(...)</code> first. As for the process level usage, <code>nedr</code> is actually a python script in which module <code>nedr</code> is imported. When <code>register(calculator, paras, **kw)</code> is called, it will do following things:
</p>

<ol class="org-ol">
<li>get the last <code>git</code> commit ID. Raise warning if current git stat is not clean
</li>
<li>get date in format YY:MM:DD
</li>
<li>for <code>arg_key, arg_value</code> in paras, check whether column <code>arg_key</code> exists. If not, create a new column with that name and assign NULL to earlier records.
</li>
<li>create data path with predefined name convention.
</li>
<li>construct the record tuple.
</li>
<li>update database.
</li>
<li>return data path.
</li>
</ol>

<p>
There are several module level variable controlling above behaviors:
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #268bd2;">_conf</span> = {}

<span style="color: #268bd2;">_conf</span>[<span style="color: #2aa198;">'dbname'</span>] = <span style="color: #2aa198;">'record.db'</span> <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">file name of the database</span>
<span style="color: #268bd2;">_conf</span>[<span style="color: #2aa198;">'tbname'</span>] = <span style="color: #2aa198;">'Records'</span> <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">table name of which we store records in.</span>
<span style="color: #268bd2;">_conf</span>[<span style="color: #2aa198;">'datadir'</span>] = <span style="color: #2aa198;">'.data/'</span> <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">where to store computation results</span>
<span style="color: #268bd2;">_conf</span>[<span style="color: #2aa198;">'path_name_fmt'</span>] = _conf[<span style="color: #2aa198;">'datadir'</span>] + <span style="color: #2aa198;">'nedr-{data}-{id}/'</span>
</pre>
</div>

<p>
Whenever the module initializes, it will create <code>_conf</code> dict as above and update it using json file <code>~/.nedrconf</code> (if exists). Then it will check the existence of the database and the table in it, and create them if absent.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Dou Meishi</p>
<p class="date">Created: 2020-11-12 四 09:56</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.2.2 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
